In [1]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /Users/arka_bagchi/opt/anaconda3/lib/python3.9/site-packages (1.4.41)
Requirement already satisfied: greenlet!=0.4.17 in /Users/arka_bagchi/opt/anaconda3/lib/python3.9/site-packages (from sqlalchemy) (1.1.1)

In [13]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy import inspect 
# Create an engine to the SQLite database
engine = create_engine('sqlite:////Applications/MAMP/htdocs/sqlite_db_pythonsqlite.db')

In [14]:
inspector = inspect(engine)
table_names = inspector.get_table_names()
print(table_names)

['Bookings', 'Facilities', 'Members']

In [15]:
#Q10
query_revenue_under_1000 = """
    SELECT name,
           SUM(CASE 
                   WHEN memid = 0 THEN slots * guestcost 
                   ELSE slots * membercost 
               END) AS revenue 
    FROM Bookings 
    LEFT JOIN Facilities USING(facid) 
    GROUP BY name 
    HAVING revenue < 1000 
    ORDER BY revenue;
"""

# Using pandas to execute the SQL query and create a DataFrame
df_revenue = pd.read_sql_query(query_revenue_under_1000, engine)

In [16]:
print(df_revenue)

            name  revenue
0   Table Tennis      180
1  Snooker Table      240
2     Pool Table      270

In [17]:
# Q11
query_recommended_members = """
    SELECT a.surname || ', ' || a.firstname AS members,
           b.surname || ', ' || b.firstname AS recommended_by 
    FROM Members a, Members b 
    WHERE a.recommendedby > 0 AND a.recommendedby = b.memid 
    ORDER BY a.surname, a.firstname;
"""

# Using pandas to execute the SQL query and create a DataFrame
df_rec = pd.read_sql_query(query_recommended_members, engine)

In [18]:
print(df_rec)

                     members      recommended_by
0            Bader, Florence    Stibbons, Ponder
1                Baker, Anne    Stibbons, Ponder
2             Baker, Timothy     Farrell, Jemima
3                Boothe, Tim         Rownam, Tim
4            Butters, Gerald       Smith, Darren
5               Coplin, Joan      Baker, Timothy
6             Crumpet, Erica        Smith, Tracy
7                Dare, Nancy    Joplette, Janice
8           Genting, Matthew     Butters, Gerald
9                 Hunt, John  Purview, Millicent
10              Jones, David    Joplette, Janice
11            Jones, Douglas        Jones, David
12          Joplette, Janice       Smith, Darren
13           Mackenzie, Anna       Smith, Darren
14             Owen, Charles       Smith, Darren
15             Pinker, David     Farrell, Jemima
16        Purview, Millicent        Smith, Tracy
17         Rumney, Henrietta    Genting, Matthew
18         Sarwin, Ramnaresh     Bader, Florence
19               Smith, Jack       Smith, Darren
20          Stibbons, Ponder       Tracy, Burton
21  Worthington-Smyth, Henry        Smith, Tracy

In [19]:
# Q12
query_facility_usage_by_members = """
    SELECT name AS facility, 
           firstname || ' ' || surname AS member_name,
           COUNT(surname) AS 'usage' 
    FROM Bookings 
    LEFT JOIN Facilities USING(facid) 
    LEFT JOIN Members USING(memid) 
    WHERE memid != 0 
    GROUP BY name, member_name;
"""

# Using pandas to execute the SQL query and create a DataFrame
df_usage = pd.read_sql_query(query_facility_usage_by_members, engine)

In [20]:
print(df_usage)

            facility       member_name  usage
0    Badminton Court    Anna Mackenzie     30
1    Badminton Court        Anne Baker     10
2    Badminton Court      Burton Tracy      2
3    Badminton Court      Charles Owen      6
4    Badminton Court      Darren Smith    132
..               ...               ...    ...
197   Tennis Court 2  Ramnaresh Sarwin     11
198   Tennis Court 2        Tim Boothe     52
199   Tennis Court 2        Tim Rownam      6
200   Tennis Court 2     Timothy Baker      7
201   Tennis Court 2       Tracy Smith      2

[202 rows x 3 columns]

In [22]:
#Q13
query_facility_usage_by_month = """
    SELECT strftime('%m', starttime) AS month, 
           name AS facility, 
           COUNT(name) AS 'usage' 
    FROM Bookings 
    LEFT JOIN Facilities USING(facid) 
    WHERE memid != 0 
    GROUP BY month, name;
"""

# Using pandas to execute the SQL query and create a DataFrame
df_month = pd.read_sql_query(query_facility_usage_by_month, engine)

In [23]:
print(df_month)

   month         facility  usage
0     07  Badminton Court     51
1     07   Massage Room 1     77
2     07   Massage Room 2      4
3     07       Pool Table    103
4     07    Snooker Table     68
5     07     Squash Court     23
6     07     Table Tennis     48
7     07   Tennis Court 1     65
8     07   Tennis Court 2     41
9     08  Badminton Court    132
10    08   Massage Room 1    153
11    08   Massage Room 2      9
12    08       Pool Table    272
13    08    Snooker Table    154
14    08     Squash Court     85
15    08     Table Tennis    143
16    08   Tennis Court 1    111
17    08   Tennis Court 2    109
18    09  Badminton Court    161
19    09   Massage Room 1    191
20    09   Massage Room 2     14
21    09       Pool Table    408
22    09    Snooker Table    199
23    09     Squash Court     87
24    09     Table Tennis    194
25    09   Tennis Court 1    132
26    09   Tennis Court 2    126